class GovernmentActionRule:
    """
    政府活動ルール

    検討,施行,改正,訓示,要請,認可,
    契約,訴訟,勧告,
    期日,
    意思決定,アクション,
    方策内容,方策作成,
    背景,所見,
    創立,連携,
    システム管理,
    支援,募集,
    融資,購入,売却,
    情報公開,
    会談,派遣,
    イベント,
    その他

    """
    # 検討
    kentou_dic = [
        "審議", "判断", "可否", "審査", "諮問", "検討", "試算", "見直す", "策定"
    ]
    # O-V 規則
    o_v_kentou_dic = {"obj": {"法", "法律", "規則"},
                      "verb": {"整理", "まとめる", "整える", "分析", "見直す"}
                      }

    o_v_kentou2_dic = {"obj": {"見直し"},
                       "verb": {"行う", "行って"}
                       }

    # 施行, "定める"
    sekou_dic = [
        "施行", "公布", "提出", "発行", "発効", "発動", "締結", "閣議決定"
    ]

    # 改正
    kaisei_dic = [
        "改正", "改訂", "改定", "追加", "変更", "修正", "見直す"
    ]

    # 廃止
    haishi_dic = [
        "廃止", "撤廃", "延期", "中止", "撤回"
    ]

    # 訓示
    kunji_dic = [
        "訓示", "告示", "発令", "発出", "命ずる", "発令"
    ]

    # 要請
    yousei_dic = [
        "要請", "求める", "要求", "要望"
    ]

    # 認可
    ninka_dic = [
        "承認", "認める", "許可", "該当", "適合", "認定", "認可", "できる", "了承", "了解", "受領", "採択", "解禁", "解除", "合格",
        "出せるようにする", "容認", "受理", "署名"
    ]

    # 契約
    keiyaku_dic = [
        "契約", "結ぶ", "締結", "合意", "取り交わす"
    ]

    # 訴訟
    sosyou_dic = [
        "提訴", "訴訟", "裁判", "公判", "控訴", "訴追", "起訴"
    ]

    # 勧告
    kannkoku_dic = [
        "勧告", "警告", "求める", "促す", "命ずる", "命じる", "禁止", "処分", "摘発", "指導", "行政指導", "書類送検", "発令",
        "要請", "削除要請", "通知", "命令", "削除命令", "規制", "できない", "行政処分"
    ]

    # 期日
    date_dic = [
        "延期", "延長", "開始", "終了", "期限", "迎える", "までと"
    ]

    # 意思決定(方針) , "始める", "開始"
    decision_dic = [
        "決める", "決定", "固める", "差別したとする", "決定", "示す", "方針", "推す", "強める", "減らす", "進めること", "採択", "目標",
        "加速", "模索", "進める", "続ける", "凍結", "指定", "推奨", "変更", "中止", "加える", "進める", "続ける", "乗りだす",
        "推し進める", "指定", "適用", "維持", "推計", "拡大", "縮小", "みる", "やめる", "使う", "停止", "選ぶ", "シフト", "づける",
        "結論", "控える", "支持", "推進", "増やす", "短縮", "入れる", "排除", "踏み切る", "打ち出す", "急ぐ", "示す", 
        "掲げる", "求める", "掲げる", "目指す", "予定", "進める", "推進", "加速", "強化", "拡充",
        "活用", "決定", "図る", "いたす", "いただく", "目的とする", "目標とする", "示す",
        "めどを付ける", "分かる", "出来る", "引き上げる", "引き下げる", "実質ゼロに", "促進", "広げる", "抑え込む", "変更",
        
        "回答する", "迎える", "採択", "賛同", "賛同宣言", "指定", "取りまとめる", "従う",
        "申請受付", "理解を深める", "まとめる", "選定", "設定", "措置", "引き下げる", "引下げる", "加速", "継続", "促す", "続ける",
        "停止", "促進", "対応", "反映", "講じる", "講ずる", "拡充", "確保", "強化", "図る", "定める"
    ]

    # アクション（行動）
    action_dic = [
        "使用", "取りかかる", "取り扱う", "受け付ける", "出す", "説明", "対策", "準備", "見解", "転換", "提出", "導入", "記載",
        "つなげる", "掲げる", "向ける", "先行開放", "増やすように促す", "警戒", "改善策", "電動車にする", "導入", "備える",
        "再開", "参加停止", "始める", "1つ", "二転三転", "乗り出す", "入る", "始まる", "塗り替える", "取引", "整理", "独占",
        "開放", "整備", "主催", "実施", "指定", "始動", "協力", "検査", "立てる", "かかる", "つくる", "ネット配信", "閲覧",                                                                
        "開く", "関する", "機会とする", "響く", "軽減", "言及", "呼びかける", "呼び掛ける", "行う", "削減", "指摘", "諮問する",
        "事態となる", "持つ", "受ける", "商用化", "設ける", "増える", "追加", "底上げ", "入手", "判明", "複数掲載",
        "明らかにする", "明確にする", "入れ始める", "なる", "スタート", "始まる", "始動", "本格始動", "続ける", "終わる", "終る",
        "する", "達成", "実施", "行なう", "行う", "お知らせ", "記念", "報ずる", "参加", "成功",
        "開幕", "主催", "掲げる", "倍増", "開発", "乗り出す", "乗りだす", "着手", "取り組む",

        "申請がある", "引き出す", "深化", "推移", "開発", "活用", "工程", "構築", "作る", "作成", "実用化", "取り組む",
        "取組", "進める", "推進", "発掘", "育成", "経営", "交換", "登録", "実現", "実施", "導入", "開始",
        "調べる", "追加調査", "か調べる", "調査", "検査", "取りまとめる", "改める"

    ]

    # 方策内容
    naiyous_dic = [
        "緩和", "強化", "撤廃", "検討", "決める", "対策", "枠", "要件", "規定", "規制", "申請", "担う", "盛り込む", "改訂"
    ]

    # 方策作成
    sakusei_dic = [
        "作る", "まとめる", "作成", "下げる", "上げる", "一つにする", "掲げる", "策定", "改正", "施行", "改訂"
    ]

    # 背景 (政府活動の背景。企業活動の元になる政府活動ではない)
    haikei_dic = [
        "高まる", "受ける", "踏まえる", "伸びる", "強まる", "背景", "ため", "上昇しているため", "伴う", "裏付け",

        "課題", "見据える", "及ぼす", "発生", "下回る", "経過", "直面", "必要", "必要不可欠", "不可欠", "受ける", "基づく"
    ]

    # 所見　 "みる", "見る", "見通し", "なる", "目指す",
    shoken_dic = [
        "感ずる", "思う", "考える", "感じる", "だ", "見込み", "推測", "立場", "語る",
        "断定", "断ずる", "見方", "崩す", "見積もる", "厳しい", "難しい", "見通し",
        "考え", "主張", "述べる", "認識", "否定", "評する", "予定", "必要がある",
        "力を入れる",

        "願う", "歓迎", "期待", "見込み", "見込める", "見通しとなる", "伺う", "努める", "踏まえる", "目的とする", "目的"

    ]

    # 創立
    souritsu_dic = [
        "新設", "設立", "創立", "立ち上げる", "解散", "発展的解消", "開会", "閉会", "発足", "開設", "開催", "設置", "創設",
        "立ち上げる"
    ]

    # 連携
    renkei_dic = [
        "連携", "共業", "参画", "協働", "呼びかける"
    ]

    # システム管理
    system_dic = [
        "移す", "移動", "機能更新", "システム", "アプリ", "サービス", "アップデート", "バージョンアップ", "システム構築",
        "システム管理", "プログラム", "台帳", "機能", "技術"
    ]

    # 支援
    shien_dic = [
        "支援", "後押し", "後押しする", "表彰", "補助", "贈呈", "授与", "提供"
    ]

    # 募集
    boshyu_dic = [
        "募集", "誘致", "募る", "公募", "招請"
    ]

    # 融資
    yuushi_dic = [
        "拠出", "出資", "ファンド", "融資", "資金提供", "支援", "投資", "補助", "負担", "つける"
    ]

    # 購入
    kounyuu_dic = [
        "購入", "落札"
    ]

    # 売却
    baikyaku_dic = [
        "売却", "捌く", "売りわたす", "売渡す", "売る", "鬻ぐ", "販売", "譲る"
    ]

    # 情報公開
    koukai_dic = [
        "確認", "打ち出す", "公表", "発表", "公開", "通知", "発信", "指数", "回復",
        "1位", "2位", "3位", "4位", "5位", "6位", "7位", "8位", "9位",
        "1回", "2回", "3回", "4回", "5回", "6回", "7回", "8回", "9回",
        "円", "トン", "人", "増える", "減る", "上がる", "下がる", "値上がり", "値下がり",
        "上昇", "下降", "わかる", "落ち込む", "超える", "上回る", "下回る", "上方修正", "下方修正", "増加", "減少",
        "割高", "割安", "落ちる", "上る", "昇る", "騰がる", "家計調査", "報告書", "表明", "記載", "明らかにする",
        "報告", "安い", "高い", "引き上げる", "引き下げる", "判明",
        
        "掲載", "公示", "周知", "宣言", "表する", "報告書", "進捗報告", "審議記録", "閣議配布", "会議の様子", "なれる",
        "報告がある", "お知らせ", "参照"

    ]

    # 会談
    kaidan_dic = [
        "開く", "会議", "分科会",
        "会談", "議論", "意見交換", "聞く"
    ]

    # 派遣
    haken_dic = [
        "派遣", "表敬", "訪れる", "訪問", "立ち合う", "視察", "出張", "参加", "出席"
    ]

    # イベント
    event_dic = [
        "開催", "開始", "閉幕", "開幕", "中止", "延期"
    ]

    # その他
    others_dic = [
        ""
    ]






    phrase_rule = [{"label": "<検討>", "words": kentou_dic},
                   {"label": "<施行>", "words": sekou_dic},
                   {"label": "<改正>", "words": kaisei_dic},
                   {"label": "<廃止>", "words": haishi_dic},
                   {"label": "<訓示>", "words": kunji_dic},
                   {"label": "<要請>", "words": yousei_dic},
                   {"label": "<認可>", "words": ninka_dic},
                   {"label": "<契約>", "words": keiyaku_dic},
                   {"label": "<訴訟>", "words": sosyou_dic},
                   {"label": "<勧告>", "words": kannkoku_dic},
                   {"label": "<期日>", "words": date_dic},
                   {"label": "<意思決定>", "words": decision_dic},
                   {"label": "<アクション>", "words": action_dic},
                   {"label": "<方策内容>", "words": naiyous_dic},
                   {"label": "<方策作成>", "words": sakusei_dic},
                   {"label": "<背景>", "words": haikei_dic},
                   {"label": "<所見>", "words": shoken_dic},
                   {"label": "<創立>", "words": souritsu_dic},
                   {"label": "<連携>", "words": renkei_dic},
                   {"label": "<システム管理>", "words": system_dic},
                   {"label": "<支援>", "words": shien_dic},
                   {"label": "<募集>", "words": boshyu_dic},
                   {"label": "<融資>", "words": yuushi_dic},
                   {"label": "<購入>", "words": kounyuu_dic},
                   {"label": "<売却>", "words": baikyaku_dic},
                   {"label": "<情報公開>", "words": koukai_dic},
                   {"label": "<会談>", "words": kaidan_dic},
                   {"label": "<派遣>", "words": haken_dic},
                   {"label": "<イベント>", "words": event_dic},
                   {"label": "<その他>", "words": others_dic},
                   {"label": "<検討>", "rule": o_v_kentou_dic},
                   {"label": "<検討>", "rule": o_v_kentou2_dic}
                   ]

    sub_phrase_rule = [
#                {"label": "<検討>", "words": kentou_dic},
                   {"label": "<施行>", "words": sekou_dic},
                   {"label": "<改正>", "words": kaisei_dic},
                   {"label": "<廃止>", "words": haishi_dic},
                   {"label": "<訓示>", "words": kunji_dic},
                   {"label": "<要請>", "words": yousei_dic},
                   {"label": "<認可>", "words": ninka_dic},
                   {"label": "<契約>", "words": keiyaku_dic},
                   {"label": "<訴訟>", "words": sosyou_dic},
                   {"label": "<勧告>", "words": kannkoku_dic},
                   {"label": "<募集>", "words": boshyu_dic}
                   ]

    # 政府の情報発信を表す述部
    press_dic = ["促す", "発表", "公表", "策定", "抑え込む", "まとめる", "向ける", "求める", "広げる", "開く", "決める",
                 "強化", "削除命令", "導入", "推進", "持つ", "改訂", "定める", "倍増", "警戒", "掲げる", "促進",
                 "実質ゼロに", "通知", "強める", "めざす", "進める", "伴う", "引き上げる", "容認", "削除要請", "延長",
                 "固める", "出す", "発令", "対象と", "見通しとなる", "つける", "全面公開", "指定", "主催", "試算", "報告",
                 "までと"
                 ]

    """
    マルチラベルをシングルラベルに変換するルール
    , "<方策内容>"
    """

    hourei = ["<検討>", "<施行>", "<改正>", "<廃止>", "<方策作成>"]
    shihou = ["<要請>", "<訓示>", "<認可>", "<契約>", "<訴訟>", "<勧告>"]

    single_rule = [{"single": "<法令>", "labels": hourei},
                   {"single": "<行政・司法>", "labels": shihou}
                   ]

    stat_rule = ["<検討>", "<施行>", "<改正>", "<廃止>"]