class GovernmentActionRule:
    """
    政府活動ルール

    背景、所見、方策内容、方策作成、行動・方針、システム管理、組織・会合、情報発信、勧告、融資、売却、契約、審議・認可、要請、訴訟、期日、その他

    """

    # 背景 (政府活動の背景。企業活動の元になる政府活動ではない)
    haikei_dic = [
        "高まる", "受ける", "踏まえる", "伸びる", "強まる", "背景", "ため", "上昇しているため"
    ]

    # 所見　 "みる", "見る", "見通し",, "なる"
    shoken_dic = [
        "感ずる", "思う", "考える", "感じる", "だ", "見込み", "推測", "立場", "語る",
        "断定", "断ずる", "見方", "崩す", "見積もる", "厳しい", "難しい", "見通し",
        "考え", "主張", "述べる", "認識", "否定", "評する", "予定"
    ]

    # 方策内容
    naiyous_dic = [
        "緩和", "強化", "撤廃", "検討", "決める", "対策", "枠", "要件", "規定", "規制", "申請", "担う", "盛り込む", "改訂"
    ]

    # 方策作成
    sakusei_dic = [
        "作る", "まとめる", "作成", "下げる", "上げる", "一つにする", "掲げる", "策定", "改正", "施行", "改訂"
    ]

    # 行動・方針
    koudou_dic = [
        "つなげる", "掲げる", "強める", "決める", "決定", "減らす", "固める", "後押し", "向ける", "考える", "差別したとする",
        "再開", "参加停止", "使用", "始める", "支援", "示す", "取りかかる", "取り扱う", "受け付ける", "出す", "説明",
        "先行開放", "増やすように促す", "調べる", "追加調査", "停止", "電動車にする", "導入", "備える",
        "募集", "目指す", "力を入れる", "連携", "方針", "対策", "準備", "見解", "転換", "決定", "支援", "誘致", "シフト", "1つ",
        "二転三転", "進めること", "乗りだす", "乗り出す", "提出", "推す", "導入", "記載", "開発", "入る", "警戒", "改善策",
        "始まる", "採択", "目標", "募る", "使う", "塗り替える", "加速", "模索", "取引", "整理", "独占", "選ぶ", "開放", "整備",
        "主催", "進める", "続ける", "実施", "指定", "見直す", "凍結", "始動", "指定", "推奨", "中止", "加える", "変更",
        "推し進める", "指定", "適用", "維持", "推計", "拡大", "縮小", "協力", "検査", "立てる",
        "かかる", "かける", "か調べる", "つくる", "づける", "ネット配信", "みる", "やめる", "閲覧", "改定", "開設", "開催",
        "開く", "関する", "機会とする", "響く", "軽減", "結論", "言及", "呼びかける", "呼び掛ける", "控える",
        "行う", "削減", "指摘", "支持", "試算", "諮問する", "事態となる", "持つ", "受ける", "商用化",
        "推進", "整える", "設ける", "増える", "増やす", "短縮", "調査", "追加", "底上げ", "入れる",
        "入手", "排除", "判明", "複数掲載", "明らかにする", "明確にする",
        "入れ始める",
        '踏み切る', '打ち出す', '急ぐ', "示す", "まとめる", "掲げる", "なる",
        "求める",
        '開始', 'スタート', '始める', '始まる', '始動', '本格始動', '続ける', '終わる', '終る', 'する',
        '掲げる', '目指す', '達成', '予定', '実施', '行なう', '行う', '進める', '推進', '加速',
        '強化', '拡充', '活用', 'お知らせ', '決定', '記念',
        '発表', '報ずる', '検討', '公開', '図る', 'いたす', 'いただく', '目的とする', '目標とする', '示す',
        '乗り出す', '乗りだす', '着手', '取り組む', '参加', '公表', '成功', 'めどを付ける', '分かる', '出来る',
        "開幕", "主催", "策定", "改訂", "掲げる", "倍増", "引き上げる", "引き下げる"
    ]

    # システム管理
    system_dic = [
        "移す", "移動", "機能更新", "システム", "アプリ", "サービス", "アップデート", "バージョンアップ", "システム構築",
        "システム管理", "プログラム", "台帳", "機能", "技術"
    ]

    # 組織・会合
    soshiki_dic = [
        "開く", "新設", "設立", "会議", "部署", "会社", "創立", "立ち上げる", "連携", "共業", "解散", "発展的解消", "開会",
        "閉会", "発足"
    ]

    # 情報発信
    jyouhou_dic = [
        "確認", "打ち出す", "公表", "発表", "公開", "通知", "発信", "指数", "回復",
        "1位", "2位", "3位", "4位", "5位", "6位", "7位", "8位", "9位",
        "1回", "2回", "3回", "4回", "5回", "6回", "7回", "8回", "9回",
        "円", "トン", "人", "増える", "減る", "上がる", "下がる", "値上がり", "値下がり",
        "上昇", "下降", "わかる", "落ち込む", "超える", "上回る", "下回る", "上方修正", "下方修正", "増加", "減少",
        "割高", "割安", "落ちる", "上る", "昇る", "騰がる", "家計調査", "報告書", "表明", "記載", "明らかにする",
        "報告", "安い", "高い", "引き上げる", "引き下げる"
    ]

    # 勧告
    kannkoku_dic = [
        "勧告", "警告", "求める", "命ずる", "命じる", "促す", "禁止", "処分", "摘発", "指導", "行政指導", "書類送検", "発令"
    ]

    # 融資
    yuushi_dic = [
        "拠出", "出資", "ファンド", "融資", "資金提供", "支援", "投資", "補助", "負担"
    ]

    # 売却
    baikyaku_dic = [
        "売却", "捌く", "売りわたす", "売渡す", "売る", "鬻ぐ", "販売", "譲る"
    ]

    # 購入
    kounyuu_dic = [
        "購入", "落札"
    ]

    # 契約
    keiyaku_dic = [
        "契約", "結ぶ", "締結"
    ]

    # 審議・認可
    shingi_dic = [
        "承認", "審議", "認める", "判断", "許可", "該当", "適合", "可否", "審査", "認定", "認可", "できない", "できる",
        "了承", "了解", "受領", "採択", "解禁", "解除", "合格", "出せるようにする", "諮問"
    ]

    # 要請
    yousei_dic = [
        "要請", "求める", "要求", "要望", "定める", "発効", "発行", "発動", "発令"
    ]

    # 訴訟
    sosyou_dic = [
        "提訴", "訴訟", "裁判", "公判", "控訴", "訴追", "起訴"
    ]

    # 期日
    date_dic = [
        "延期", "延長", "開始", "終了", "期限", "迎える"
    ]

    phrase_rule = [{"label": '<背景>', "words": haikei_dic},
                   {"label": '<所見>', "words": shoken_dic},
                   {"label": '<方策内容>', "words": naiyous_dic},
                   {"label": '<方策作成>', "words": sakusei_dic},
                   {"label": '<行動・方針>', "words": koudou_dic},
                   {"label": '<システム管理>', "words": system_dic},
                   {"label": '<組織・会合>', "words": soshiki_dic},
                   {"label": '<情報発信>', "words": jyouhou_dic},
                   {"label": '<勧告>', "words": kannkoku_dic},
                   {"label": '<融資>', "words": yuushi_dic},
                   {"label": '<売却>', "words": baikyaku_dic},
                   {"label": '<購入>', "words": kounyuu_dic},
                   {"label": '<契約>', "words": keiyaku_dic},
                   {"label": '<審議・認可>', "words": shingi_dic},
                   {"label": '<訴訟>', "words": sosyou_dic},
                   {"label": '<要請>', "words": yousei_dic},
                   {"label": '<期日>', "words": date_dic}
                   ]
