from government_news_analysis import GovernmentNewsAnalysis

gnp = GovernmentNewsAnalysis()

text = "JISは、鉱工業品、データ、サービスの品質、性能や試験方法などを定めた国家規格であり、社会的環境の変化に対応して、制定・改正しています。また、社会的に関心の高い重要な制定や改正を月に1回紹介しています。"
text = "経済産業省と国土交通省は24日、秋田県沖と千葉県沖の3つの海域で洋上風力発電を担う事業者の公募結果を発表した。"
text = "ウィスコンシン州政府が19日、フォックスコンと税優遇契約の見直しで大筋合意したと発表した。"
text = "韓国政府は外務省内に経済安全保障の専門部署を新設する計画だ。"
text = "国税庁が1日発表した2021年の路線価で、九州7県の標準宅地の評価基準額は前年比0.4%上昇した。"

text = "国連気候変動に関する政府間パネルが9日に公表した報告書は、人間が地球温暖化を引き起こしたことを「疑う余地がない」と断じた。"
text = "彼は勉強している間がない。"

text = "大気環境及び水・土壌環境の保全に関し顕著な功績のあった団体や個人に対し、その功績を讃えるため、環境省水・大気環境局長から表彰状を授与します。"

text = "香港政府がまとめた2021年版の「境外企業調査」によると、6月時点で香港に地域統括本部を置く米国企業は254社と、18年ぶりの低い水準に落ち込んだ。"


text = "財務省は8日、政府が保有する東京地下鉄の株式を一部売却すると発表した。"
text = "政府が経済安全保障の法整備を2段階に分けて進めることが分かった。"
text = "農林水産省は9日、北海道の2021年産水稲の作況指数が108になる見通しと発表した。"
text = "経済産業省が実施した公開入札で、同省が保有する持ち分20.03%を落札した。"
text = "北海道は18日、政府が新型コロナウイルス対策の行動制限を一定の条件下で緩和する実証実験を札幌市内の飲食店やライブハウス、劇場の4施設で始めると発表した。"
text = "金融庁は上場企業など約4000社を対象に、気候変動に伴う業績などへの影響を開示するよう義務付けることを検討する。"
text = "中国政府が主催する世界インターネット大会が26日に開幕した。"
text = "北海道は新型コロナウイルス対策で政府が検討している行動制限緩和に向けた実証実験に参加する意向を17日中に伝える。"
text = "ビジネス街の丸の内や官庁が集中する霞が関にも近い東京・内幸町の街づくりが動き出した。"
text = "政府は12日からバンコクなど10都県で始めた事実上のロックダウンを、20日から13都県に拡大する。"
text = "経済産業省が21日に開く総合資源エネルギー調査会の基本政策分科会で、国のエネルギー政策の方向性を記すエネルギー基本計画と電源構成の原案を示す。"
text = "富山県は15日、政府が目指す2050年の温暖化ガス排出実質ゼロに向けて「グリーン成長戦略分野」を設けると発表した。"
text = "メキシコ湾南部のザマ油田を巡り、メキシコのエネルギー省が運営会社として国営石油会社ペメックスを選ぶ方針を示したことが明らかになった。"
text = "韓国政府が日本への依存度の高い品目で国産化を推進する「脱日本」は道半ばだ。"
text = "政府が策定する次期エネルギー基本計画で、2030年に再エネの発電比率を40%超とする目標設定を改めて求めた。"
text = "米司法省がトランプ前政権下で米紙ニューヨーク・タイムズの記者4人の通話記録を極秘に入手していたことが3日までに分かった。"
text = "新型コロナウイルスの感染拡大が長期化し、政府が5月31日までとする9都道府県の緊急事態宣言は延長が検討されている。"
text = "経済産業省は一定の投資効果を得られたとみて、2022年3月までの期限を延ばすよう、財務省と本格協議に入る。"
text = "自民党のルール形成戦略議員連盟は、経済安全保障を巡り政府と経済団体が話し合う協議会の創設を求める提言を近くまとめる。"
text = "住友商事は14日、6月の株主総会で環境系非政府組織が提出した気候変動の事業戦略策定・開示へ定款変更を求める株主提案に対し、反対すると発表した。"
text = "経済産業省の有識者会議が6月にまとめる中間答申に盛り込む。"
text = "11日にはカナダ政府が「エネルギー安全保障に不可欠だ」として閉鎖に反対する準備書面を米連邦裁判所に提出した。"
text = "農業の脱炭素化に向け、農林水産省が近くまとめる農機などの開発の工程表が明らかになった。"
text = "新型コロナウイルス感染拡大の長期化を受け、政府は7日、大阪府など4都府県を対象に11日を期限としていた緊急事態宣言の期間を31日まで延長すると決めた。"
#text = "農林水産省がまとめた3月末の国産針葉樹合板の在庫は11万3879立方メートルだった。"
#text = "政府が新型コロナウイルス感染者の急増する東京都、大阪府、兵庫県、京都府を対象に3度目の緊急事態宣言に踏み切る方針を決め、北海道でもホテルの予約キャンセルが出始めた。"
#text = "政府は酒類を提供する飲食店に休業要請を出す見通し。"
#text = "産学官での連携により、政府が教育のデジタル化を目指す「GIGAスクール構想」を推進する。"
#text = "独政府の「経済安定化ファンド」が議決権を持たない「サイレントパーティシペーション」方式で注入した公的資金の返済にあてるほか、資本構造の強化にもつなげる。"



#text = "ビジネス街の丸の内や官庁が集中する霞が関にも近い東京・内幸町の街づくりが動き出した。"
#text = "住友商事は14日、6月の株主総会で環境系非政府組織が提出した気候変動の事業戦略策定・開示へ定款変更を求める株主提案に対し、反対すると発表した。"

# 背景
#text = "特許庁がまとめた報告書を参考に、世界の技術開発動向などを探った。"
#text = "特許庁がまとめた報告書をもとに開発状況などを探った。"
#text = "ベトナム運輸省が国内線の特定ルートで運航の再開を認めたことで、ベトナム航空や格安航空会社最大手のベトジェットエア、新興のバンブー航空などが具体的な運航便を発表した。"
#text = "政府が検討する新型コロナウイルスのワクチン接種者を対象にした行動制限の緩和に期待が集まる。"
#text = "カルチュア・コンビニエンス・クラブ傘下のCCCマーケティングは26日、福島県会津若松市で進む政府の「スーパーシティ」構想に参加すると発表した。"
#text = "政府の分科会が12日に人流抑制に向けて百貨店に強力な措置を求めたことを受けて、新型コロナウイルス下で初めて実施した。"
#text = "総務省がまとめた2020年度の北海道内市町村のふるさと納税受け入れ額をみると、オホーツク海側の紋別市が2年連続で首位を保った。"
#text = "ジェネリック医薬品メーカーの小林化工や日医工などで相次いで品質不正が発覚したことを受け、厚生労働省と沖縄県を除く46の都道府県が各地の後発薬などの製造工場に立ち入り検査していたことが14日分かった。"
#text = "政府が提供する米モデルナ製ワクチンを使う。"
#text = "日本政府観光局の清野智理事長は日本経済新聞のインタビューに応じ、新型コロナウイルスの感染拡大の前に政府が掲げた「2030年に訪日外国人6000万人」の目標を巡り「ワクチン接種のスピードが上がって国内の受け入れ体制が整えば、現時点でも実現可能だ」との認識を示した。"
#text = "近く政府に提出し、政府が今夏に改めるエネルギー基本計画への反映を要求する。"
#text = "政府が新たに設けた支援策を活用して、悪化した財務基盤を強化する。"
#text = "政府が脱炭素の目標を大幅に引き上げたこともあり、温暖化ガスの排出量が多い石炭火力の新設計画はこれでゼロになった。"
#text = "政府が新型コロナウイルス感染者の急増する東京都、大阪府、兵庫県、京都府を対象に3度目の緊急事態宣言に踏み切る方針を決め、北海道でもホテルの予約キャンセルが出始めた。"
#text = "東京電力ホールディングスが会長兼取締役会議長に、三菱ケミカルホールディングス会長の小林喜光氏を招く方向で政府と最終調整に入ったことが、22日分かった。"
#text = "政府が東京電力福島第1原子力発電所の敷地内でたまる処理水の海洋放出を決めたことを受け、東京電力ホールディングスの小早川智明社長は16日、福島県庁で内堀雅雄知事に会い、放出に関連する規制の順守や風評被害への賠償などの方針を説明した。"

#　政府
##text = "経済産業省が21日に開く総合資源エネルギー調査会の基本政策分科会で、国のエネルギー政策の方向性を記すエネルギー基本計画と電源構成の原案を示す。"
##text = "政府が策定する次期エネルギー基本計画で、2030年に再エネの発電比率を40%超とする目標設定を改めて求めた。"
##text = "農業の脱炭素化に向け、農林水産省が近くまとめる農機などの開発の工程表が明らかになった。"

#text = "政府が経済安全保障の法整備を2段階に分けて進めることが分かった。"
#text = "中国政府が主催する世界インターネット大会が26日に開幕した。"
#text = "メキシコ湾南部のザマ油田を巡り、メキシコのエネルギー省が運営会社として国営石油会社ペメックスを選ぶ方針を示したことが明らかになった。"
#text = "米司法省がトランプ前政権下で米紙ニューヨーク・タイムズの記者4人の通話記録を極秘に入手していたことが3日までに分かった。"
#text = "自民党のルール形成戦略議員連盟は、経済安全保障を巡り政府と経済団体が話し合う協議会の創設を求める提言を近くまとめる。"
#text = "経済産業省の有識者会議が6月にまとめる中間答申に盛り込む。"

# 政府
text = "経済産業省が21日に開く総合資源エネルギー調査会の基本政策分科会で、国のエネルギー政策の方向性を記すエネルギー基本計画と電源構成の原案を示す。"
text = "政府が策定する次期エネルギー基本計画で、2030年に再エネの発電比率を40%超とする目標設定を改めて求めた。"
text = "農業の脱炭素化に向け、農林水産省が近くまとめる農機などの開発の工程表が明らかになった。"

text = "財務省は8日、政府が保有する東京地下鉄の株式を一部売却すると発表した。"
text = "総務省の調査は行政の現場に多数ある定型作業を効率化するAI導入を調べたもの。"
text = "農林水産省は9日、北海道の2021年産水稲の作況指数が108になる見通しと発表した。"
text = "金融庁は上場企業など約4000社を対象に、気候変動に伴う業績などへの影響を開示するよう義務付けることを検討する。"
text = "政府がリチウムの採掘を独占するほか、電力市場で国営企業を優遇する措置を導入する。"
text = "日本政府が掲げた高い目標の達成に向け、経済産業省資源エネルギー庁の政策立案力や調整力が問われている。"
text = "政府は12日からバンコクなど10都県で始めた事実上のロックダウンを、20日から13都県に拡大する。"
text = "富山県は15日、政府が目指す2050年の温暖化ガス排出実質ゼロに向けて「グリーン成長戦略分野」を設けると発表した。"
text = "独政府の「経済安定化ファンド」が議決権を持たない「サイレントパーティシペーション」方式で注入した公的資金の返済にあてるほか、資本構造の強化にもつなげる。"
text = "新型コロナウイルスの感染拡大が長期化し、政府が5月31日までとする9都道府県の緊急事態宣言は延長が検討されている。"
text = "自民党のルール形成戦略議員連盟は、経済安全保障を巡り政府と経済団体が話し合う協議会の創設を求める提言を近くまとめる。"
text = "11日にはカナダ政府が「エネルギー安全保障に不可欠だ」として閉鎖に反対する準備書面を米連邦裁判所に提出した。"
text = "新型コロナウイルス感染拡大の長期化を受け、政府は7日、大阪府など4都府県を対象に11日を期限としていた緊急事態宣言の期間を31日まで延長すると決めた。"

text ="政府が東京電力福島第1原子力発電所の敷地内でたまる処理水の海洋放出を決めたことを受け、東京電力ホールディングスの小早川智明社長は16日、福島県庁で内堀雅雄知事に会い、放出に関連する規制の順守や風評被害への賠償などの方針を説明した。"
text = "政府が新型コロナウイルス感染者の急増する東京都、大阪府、兵庫県、京都府を対象に3度目の緊急事態宣言に踏み切る方針を決め、北海道でもホテルの予約キャンセルが出始めた。"
text = "カルチュア・コンビニエンス・クラブ傘下のCCCマーケティングは26日、福島県会津若松市で進む政府の「スーパーシティ」構想に参加すると発表した。"

text = "世界的な脱炭素の流れを意識し、60年までに二酸化炭素排出量の実質ゼロを目標に掲げる中国政府の方針に対応する。"
text = "政府の個人情報保護委員会は22日、同社に近く行政指導する方針を固めた。"
text = "政府の田中委員長も23日に行政指導している。"
text = "新型コロナウイルス禍で事業の効率改善を急ぐなか、業務のデジタル化や車内放送の一部省略が進み対応できると判断した。"
text = "英国の競争・市場庁は30日、米メタに対し、2020年に買収したGIF画像共有サービス大手の米ジフィーを売却するよう命じた。"
text = "米エネルギー省のターク副長官は6日、ヒューストンで開催された世界石油会議で、「石油・ガスの国内企業のリーダーシップが必要とされている。国内総生産は成長し、石油・ガス業界の利益水準は回復しているのに、生産が回復していない」などと述べ、石油会社に生産量を増やすように促した。"
text = "各国政府がガソリン車販売への規制を強めるなか、電気自動車の普及が加速している。"
text = "経済産業省所管の石油天然ガス・金属鉱物資源機構とカナダ・アルバータ州は、脱炭素に向けて環境負荷の低い燃料に関する共通基準や二酸化炭素排出量の計測ルールをつくる。"
text = "いくら現場で奮闘しても、システムを提供する政府への信頼がなければ国民に受け入れてもらえないこともあるだろう。"
text = "上場企業を対象にした政府の調査で、サプライチェーン上の人権侵害リスクを把握する「人権デューデリジェンス」に取り組んでいる企業が52%だったことがわかった。	"
text = "新型コロナウイルス対策の行動制限を一定の条件下で緩和する政府の「ワクチン・検査パッケージ」の実証実験が21日、京都府内の日本料理店23店舗で始まった。"
text = "自民党のルール形成戦略議員連盟は、経済安全保障を巡り政府と経済団体が話し合う協議会の創設を求める提言を近くまとめる。"

#text = "特許庁がまとめた報告書をもとに開発状況などを探った。"
#text = "総務省幹部への接待問題が発覚後、官僚らとの個別の会食を原則、禁止する決まりを設けた。"
#text = "各国政府が「脱炭素」の政策を競うなか、脱炭素への姿勢を鮮明にして巨大市場を取り込む。"
#text = "タイ運輸省傘下の民間航空局は首都バンコクの空港などを発着する国内線の運航を21日から原則禁止すると発表した。"
#text = "日本の半導体産業の再興に向けた政府の戦略が発表された。"
#text = "筆頭株主である仏政府の意向も背景にあり、同社は2030年までに温暖化ガス排出量を05年比で実質半分にする目標達成に弾みをつける。"
#text = "7月に設立される仙台村田製作所の社長に就任予定の橋本省吾氏は、同拠点で生産する電子部品の生産量を2022年度中に1割増やす方針を示した。"
#text = "職場や大学での新型コロナウイルスワクチンの接種について、政府への申請が8日始まった。"
#text = "自民党のルール形成戦略議員連盟は、経済安全保障を巡り政府と経済団体が話し合う協議会の創設を求める提言を近くまとめる。"
#text = "人工知能などで住みやすい都市を実現する政府の「スーパーシティ」構想で、前橋市は小学校から大学までの一貫校を市内に設置する計画を盛り込んだ。"

#text = "上場企業を対象にした政府の調査で、サプライチェーン上の人権侵害リスクを把握する「人権デューデリジェンス」に取り組んでいる企業が52%だったことがわかった。"
#text = "豊田自動織機は15日、ディーゼルエンジンを河川排水ポンプの動力源として使う国土交通省の実証実験に参加すると発表した。"

#text = "配達や持ち帰りに限っていた政府の外食促進策「Go To、イート」は店内での飲食にも使えるようにする。"
#text = "各国、地域の政府が大規模な財政支援を打ち出す中、日本の半導体政策には何が必要か。"
##text = "新型コロナウイルスの感染拡大が長期化し、政府が5月31日までとする9都道府県の緊急事態宣言は延長が検討されている。"
#text = "近く政府に提出し、政府が今夏に改めるエネルギー基本計画への反映を要求する。"

#text = "米エネルギー省のターク副長官は6日、ヒューストンで開催された世界石油会議で、「石油・ガスの国内企業のリーダーシップが必要とされている。国内総生産は成長し、石油・ガス業界の利益水準は回復しているのに、生産が回復していない」などと述べ、石油会社に生産量を増やすように促した。"
#text = "スペイン政府は20年以上も前から気候変動対策を優先課題と考え、再生可能エネルギーへの転換に取りかかった。"
#text = "日本政府は半導体の安定調達につながるとし、世界でも有数の技術力を持つTSMCの誘致に過去数年間、力を入れてきた。"
#text = "政府は追加接種をにらみ、ファイザーと1億2000万回分のワクチン供給に向けて協議をしている。"
#text = "国交省は26日に同報告の修正案を示し、不測の事態が起これば工事を一時中断して河川や地下水への影響を確認するなど、JR東海が監視を徹底すると盛り込んだ。"
#text = "厚生労働省は17日、専門家会議を開き、遺伝子を効率よく改変するゲノム編集技術を使って品種改良したマダイについて、安全審査を不要と判断した。"
#text = "ただ米政府は半導体の過度なアジア依存から脱し、中国に対抗しようとTSMCを国内に誘致した。"
#text = "政府は省庁横断チームを設け、マネロン対策の不備を修正する法改正などを急ぐ。"
#text = "政府が新型コロナウイルスのワクチンに関し、高齢者向けの確保にめどがついたとみて12~64歳の一般向け接種に本格的に着手する。"
#text = "11日にはカナダ政府が「エネルギー安全保障に不可欠だ」として閉鎖に反対する準備書面を米連邦裁判所に提出した"
#text = "政府は産業界と組み、情報処理や通信に使う量子技術の共同研究に乗り出す。"
#text = "中国政府が12月初めに国連宇宙空間平和利用委員会に提出した書面をもとに、ロイター通信が最初に報じた。"

text = "21日に公表されたエネルギー基本計画の原案で、経済産業省は2030年度の電源に占める原子力の比率を20~22%とする現行の目標値を維持した。"



# 政府活動のチェック
government_phase = gnp.government_phase_extract(text)
#government_phase = gnp.government_action_extract(text)
print(government_phase)