class SpecialVerb:
    """
    企業活動表現の動詞辞書

    """
    campany_special_verb = [
        'ある', 'おこなう', 'かかげる', 'かまえる', 'けん引', 'コンセプトと', 'コンセプトに', 'コントローラーに','コントロール',
        'サポート', 'する', 'する', 'セットに', 'テーマに', 'ミッションと', 'ライトアップ','リード',
        '運営', '営む', '遠隔管理', '応援', '解決', '開業', '開催', '開始','開発・運営', '開発・提供', '開発・販売', '成長',
        '開発', '活用', '管理', '企画・開発','企画販売', '協賛', '強みと', '強化', '掲げる', '掲載', '経営', '公開',
        '構える','構築', '行う', '行なう', '採用', '支援', '実現', '実行', '主力と', '取り扱う', '手がける','手掛ける',
        '手伝い', '集める', '承る', '称', '進める', '図る', '推進', '生産', '製造・販売','製造', '製造販売', '説明',
        '洗浄', '全国展開', '促進', '続ける', '担う', '置く','中心と', '提案', '提供', '展開', '得意と', '届ける','入れる',
        '発行', '発信', '発売','発売', '発表', '販売', '販売開始', '務める', '目指す', '利用', '理念と', '立ち上げる', '抱える'
    ]
