[
    "電気事業連合会の池辺和弘会長（九州電力社長）は１６日、日本記者クラブ主催のオンライン記者会見で、脱炭素社会の実現に向けた取り組みについて「電力供給側はもちろん、需要側もあわせて両面の取り組みが重要だ」と述べた。\n",
    "記者会見で、池辺氏は２０５０年に温室効果ガス排出量を実質ゼロにするカーボンニュートラル社会の実現に向け、発電側の取り組みとして再生可能エネルギーの導入を進めると説明。\nその上で、気象条件などに左右される発電量の不安定さを補うため大型蓄電池などの技術開発の必要性を強調した。\n",
    "一方、再エネの普及促進を目指した固定価格買い取り制度（ＦＩＴ）には「電化の推進には安価な電気料金が必要だが、ＦＩＴ賦課金の上昇がブレーキをかける。\n社会全体の負担のあり方を考える必要がある」と訴えた。\n２０２０（令和２）年度の賦課金総額は２・４兆円に上り、平均的な家庭で１カ月あたり７７４円を負担している。\n",
    "原子力発電に対しては「確立した脱炭素技術であり、電力供給の安定性や運転コスト面でも欠かすことができない」と強調。\n東京電力福島第１原発事故後の原発の長期停止で「（国内で）供給力が恒常的に不足し、火力発電（の燃料調達動向や資源価格）が（電気料金や需給バランスに）大きく影響与えている」と指摘した。\n",
    "足元の電力需給逼迫(ひっぱく)やウクライナ情勢などを受けた資源価格の高止まりの長期化懸念を念頭に「エネルギーセキュリティーはナショナルセキュリティーだ。\n原発再稼働を早期に進めるため（審査する原子力規制委員会の）要員を追加することが重要だ」と述べた。\n",
    "また、原発の新増設が長期間滞っている現状が関連産業に携わる人材や技術の先細りを招いていることに触れ、「（原発利活用について）国からも早期に明確なメッセージを出してもらいたい」と力を込めた。\n",
    "あわせて、現在は１３カ月ごとに実施している原発の定期検査の間隔が法的には延長可能なことを問われ「技術的な検証を進めている」とした。\n原子炉等規制法上原則４０年とされる運転期間延長には「（既存原発の有効活用は）二酸化炭素を削減するためのコスト効率が最も良い。\n科学的な論拠に立って議論してもらいたい」とした。\n",
    "「科学的な議論」とは、池辺氏が常に原子力政策をめぐる見解で強調することだ。\n１６日の記者会見でも、脱原発を進めるドイツと、原発の活用を進めるフランスを対比させた質問に対して、池辺氏は「原子力のベネフィット（恩恵）とリスクを皆で議論するべきときではないかと思っている」と応じた。\n",
    "ただ、このような冷静な議論に逆行する動きはいまだあり、社会的影響力を持つ層からの発信も問題化している。\n小泉純一郎、菅直人両氏ら５人の首相経験者が１月、「福島県内の子供が甲状腺がんに苦しんでいる」などとした書簡をＥＵ（欧州連合）欧州委員会に送ったことはその典型だ。\n",
    "この書簡に対し、山口壮環境相は１日、福島原発事故による被爆と発症の関連性は認められないと反論。\n両者の因果関係については国連放射線影響科学委員会など、国内外の専門家や研究機関が否定している。\nしかし５氏は「脱原発」運動に取り組む市民団体を通じて抗議を重ねた。\n",
    "この際、政府側の反応を「原発のマイナスイメージや反原発世論を拡大したくないという思惑」「裏では、原発の再稼働や新増設を目指す『原発ムラ』の意向が働いているのだろう」などと解説する一部報道もあった。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "英シェルは世界５カ国で、カーボンニュートラル（ＣＮ）型の製油所・化学一体工場「エネルギー＆ケミカルズパーク」（ＥＣＰ）の構築を進めている。\n再生可能エネルギーを活用し、ＣＣＵＳ（二酸化炭素の回収・貯留・利用）インフラも整備。\n製油所をバイオ燃料や化学品原料の生産拠点といわば再定義し、廃プラ由来合成油を原料とする「再生可能化学品」などの供給拠点とする。\n一方で米中、中東といった原料競争力の維持や市場拡大が見込める国・地域でのエチレン投資も継続。\n原油開発と製油所経営に逆風が吹くなか、化学品事業を収益の軸の一つに据える。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "JFEホールディングスが「トランジション（移行）」の資金を調達する。\n独自の移行戦略を策定し、国内製造業で初となる債券を発行する。\n",
    "JFEホールディングス（HD）は2022年1月20日、資金使途をESG分野に絞る債券発行の決定を発表した。\n同社によれば発行額は300億円程度、22年度上期の発行を検討しており償還期限や利率はこれから決まる。\n発行支援のストラクチャリングエージェントは野村証券が務める。\n",
    "脱炭素に向けて変化する「トランジション（移行）」に必要な活動に調達した資金を投じるトランジションボンド（移行債）を発行する。\n国内製造業では初の事例だ。\n製鉄のCO₂排出源となる高炉を中心に、高度な省エネや高効率化を進める他、CO₂排出を大幅に減らす技術革新など4分野に使途を限定する。\nこうした移行債の方針を、同社の「フレームワーク」としてまとめ、同日発表した。\n",
    "省エネや高効率化のため人工知能（AI）やIoT（モノのインターネット）技術を採用する。\nまた、高炉から排出するCO₂を回収して鉄鉱石の還元に再利用する独自技術「カーボンリサイクル高炉」や、石炭を使わず水素で鉄鉱石を還元するCO₂排出ゼロの水素製鉄の開発にも、移行債で調達した資金を投じる。\n",
    "21年5月、24年度まで4年間の第7次中期経営計画に、グループの「環境経営ビジョン2050」を組み込んだ。\n鉄鋼事業のCO₂排出量を24年度に13年度比で18％削減し、50年に鉄鋼やエンジニアリング事業を含むグループ全体でカーボンニュートラル（実質ゼロ）を目指すという。\n",
    "省エネや技術革新は実質ゼロの実現に必須となる。\n中計の4年で鉄鋼事業の脱炭素化に1600億円、グループ全体では3400億円（鉄鋼事業を含む）の脱炭素投資を発表した。\n移行債による調達資金も充当していく。\n",
    "国際基準への適合で高い評価",
    "同社は、移行債のフレームワークが、ESGファイナンスの国際基準にのっとっていることも発表した。\nグリーンボンド原則などを作った国際資本市場協会（ICMA）による移行債の国際基準、「クライメート・トランジション・ファイナンス・ハンドブック2020」にのっとった。\n",
    "第三者評価を行う日本格付研究所も、ICMA基準への適合を高く評価した。\n一般に、この基準への適合が評価された債券は、債券投資家の需要が高まる傾向がある。\nこの基準は、資金調達者の移行戦略などの4項目の開示を求めている。\n日本格付研究所は、JFEの中計や環境経営ビジョン、フレームワークが、ICMAの要件に沿うことを確認している。\n",
    "国内製造業による移行債の発行事例が続くとみられるが、開示が必要な移行戦略などの策定も周到に用意しておく必要がある。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "お得な情報| 手頃な価格の水素の先端にオフィスがありますか？",
    "商用ダイビング機材排出量経営管理部門本ソフトウェア",
    "建物で水素生産を試験的に行っている会社は、再生可能エネルギーの選択肢がほとんどない暖房システムを脱炭素化するために30万ドルを調達しました。\n",
    "Modern Electronは、家庭やオフィスで天然ガスを取り、それを固体炭素と水素の混合物に還元するガスから水素へのコンバーターを開発しています。\n その後、水素は建物内の熱とエネルギーに使用されます。\n",
    "炭素を大気中に放出する代わりに、コンバーターは、最終的に埋め立て地に捨てられる可能性はありますが、グラファイトとして再利用できる可能性のある形で炭素を収集します。\n",
    "Modern Electronのアイデアはカーボンフリーではありませんが、特に再生可能エネルギーの電化にアクセスできないか、まだ高すぎる場合に、天然ガスを使用している既存の暖房システムの廃棄物を削減することを目的としています。\n",
    "CEOのTonyPanは以前、このアプローチ（彼が「ハイブリッド暖房」と呼んでいるもの）は、ハイブリッド車と同じように脱炭素化に向けた一歩であると主張しました。\n",
    "水素パイロットと並んで、Modern Electronは資金調達からの収益を使用して、ボイラーの排熱を電気に変換する既存の製品を展開します。\n",
    "モダンエレクトリックは、この技術を「HVACおよびエネルギーシステムの大手メーカー」と統合することを計画していると述べた。\n",
    "シリーズBの資金調達は、At One Venturesが主導し、新しい投資家であるExtantia、Starlight Ventures、Valo Ventures、および戦略的投資家であるIrongreyとWielandGroupが参加しました。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "燃料電池システム世界市場、35年度に46.7倍　民間予測",
    "調査会社の富士経済（東京・中央）は燃料電池システムの2035年度の世界市場が20年度比46.7倍の12兆5813億円になるとの予測を発表した。\n世界で広がる脱炭素の動きを背景に、日本や欧米、中国、韓国などを中心に燃料電池車（FCV）やトラック・バスの普及が市場をけん引するとみる。\n",
    "21年度は前年度比38.5%増の3734億円を見込む。\n米国と韓国で工場や発電施設などでの導入が進んでおり、産業・業務用は市場全体の3割以上を占める。\n今後は主要各国で内燃機関車からFCVへの切り替えが進むほか、船舶や鉄道での利用増が燃料電池システムの市場拡大を後押しすると分析する。\n",
    "分野別にみると、FCVでの市場は35年度に20年度比で138倍の7兆7014億円になると予測する。\nトヨタ自動車の「ミライ」や韓国の現代自動車の「ネッソ」の投入が市場拡大をけん引している。\n各国の自動車メーカーがFCVの開発を進めており、FCVの普及が加速するとみられる。\n",
    "燃料電池トラック・バスの市場は102倍の2兆8836億円になると予測する。\n欧州や中国を中心に市場拡大が続くとみる。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "日本取引所グループ（JPX）は14日、新たな資金調達の方法として、野村ホールディングス子会社のBOOSTRYが持つ技術を活用し、「グリーン・デジタル・トラック・ボンド（デジタル環境債）」を発行することを検討すると発表した。\nデジタル証券（セキュリティトークン）を活用し、新たな資金調達方法の領域へ踏み出す。\n",
    "JPXはグループ全体で消費する電力の全てを再生可能エネルギーに切り替え、2024年度までにグループ全体でカーボン・ニュートラル達成を目指している。\nその一環として、太陽光発電への投資、廃食用油を燃料としたバイオマス発電設備への投資金額の一部を、「グリーン・デジタル・トラック・ボンド」として調達する予定だ。\n",
    "グリーン・デジタル・トラック・ボンドとは、ブロックチェーン技術を活用し、透明性の向上および、データ収集の効率化を目指す債権。\n具体的には、太陽光発電設備、バイオマス発電設備の発電量を自動的に計測し、CO2削減量に換算、記録する仕組みを構築する。\nこれを投資家がモニタリングできるシステムを構築し、高い透明性を提供していくという。\n今まではグリーン投資に関わるデータの収集や透明性を確保することは発行サイドに負担が大きく、提供される資料も年次報告程度であった。\nこれらの信憑性について、投資家側も疑問視していた。\n",
    "今回、BOOSTRYの持つセキュリティ・トークンのプラットフォーム（ibet for fin）を用いて、発電量やCO2削減量をブロックチェーン上に記録する予定だ。\n記録されたデータは過去に遡って改ざんすることは困難であるため、信頼性を高めることが可能となる。\nまた、当該プラットフォームを利用することで、債権を投資家がどれだけ保有しているかなどの状況を即時・正確に把握できるため、今後のIRへの活用も検討中だという。\n",
    "将来的には、サステナビリティ目標の達成状況によって利率などの条件をスマートコントラクトを利用して自動変換させるサステナビリティ・リンク・ボンドの実装も検討しているという。\n（提供：月刊暗号資産）",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "脱炭素社会の実現に向け、一定規模以上の建物を新築・増改築する際に太陽光発電などの再生可能エネルギーの設置を義務化する自治体が広がりつつある。\n東京都と群馬県は２月に設置義務化に向けた条例案を議会に提出する。\n可決されれば、京都府、京都市に次ぐ事例となり、大企業はもちろん中小企業も対応を迫られることになる。\n",
    "東京都、90坪未満の住宅まで対象にした設置義務化は全国初",
    "東京都は、2050年に都内の温室効果ガス排出量を実質ゼロにする目標を掲げている。\n",
    "実現に向けては、2030年までの10年間の行動がカギを握るとし、2021年１月、2030年までに温室効果ガスを2000年比で50%削減する「カーボンハーフ」を表明。\nカーボンハーフ達成に向け、2022年２月４日には、2,000平方メートル未満の住宅やビルなどの新築建物へ太陽光発電の設置を義務づける新たな取り組み、「2030年カーボンハーフに向けた取組の加速 -Fast forward to “Carbon Half”-」を公表した。\n",
    "東京都の新条例は、１棟の延べ床面積が300平方メートル（約90坪）未満の住宅まで対象にする。\n太陽光発電の設置義務化で、90坪未満の住宅まで対象にした制度は全国初だ。\n大手企業のみならず、中小企業、そして一般家庭も今後、対応を迫られることになる。\nただし、脱炭素の機運が高まるとはいえ、太陽光発電の設置はコスト負担が増す。\nハードルは決して低くない。\nなぜ都は規制を強化するのか。\n",
    "東京都の温室効果ガス排出量は2000年度から減少傾向を辿るが、2019年度で6,211万トンと2000年度比8.0%減少にどどまる。\nとりわけ都内CO2排出量のうち、７割を占める建物への対策強化は急務だ。\n",
    "そのひとつである家庭部門は、１世帯あたりのエネルギー原単位は減少しているものの、世帯数の数が2000年比で約30%増加しており、エネルギー消費量は増加傾向にある。\nさらに東京の世帯数は2035年まで増える見込みだ。\nこれまでも2,000平方メートル以上の大規模建物について再エネ設置の義務を条例化していたが、毎年約4.3万棟の新築住宅が建設される中、2,000平方メートル以上はわずか１%。\n99%が2,000平方メートル以下だ。\n",
    "一方、都内における太陽光発電の導入状況は、総ストック数約225万棟のうち、４%の約9.5棟にしか設置されていない。\n築６年未満の新しい建物での導入率は12%を超えるが、それでも２割未満だ。\n住宅やビルなどの建物は一度、建てられると数十年にわたって使用される。\n今後新たに建てられる建築物を脱炭素化できなければ、2050年目標の達成は危うい。\n目標実現に向けては、やはり太陽光発電の導入義務化の強化が欠かせない。\n",
    "都は条例を強化させるとともに、再エネの導入・調達の加速化に向けた支援策も拡充する方針だ。\n",
    "まず産業部門では、2022年度の当初予算案に前年度の３倍となる12億円を計上し、電力の地産地消に向け、自家消費型の再エネを導入する民間企業や区市町村を支援する。\nさらに民間企業が再エネ電源を確保しやすくするため、都外に設置する自家消費型再エネ施設の導入支援も拡充する。\n予算額は前年度比５倍となる10億円を計上した。\nただし、支援規模は６件（１件あたりの補助上限２億円）とその効果は限定的だ。\n",
    "家庭部門に対しては、住宅の脱炭素化を加速させるべく、2022年度から太陽光発電の設置補助金を上乗せ強化する。\n補助額を１kWあたり10万円から12万円に増額し、規模は1,412件から１万1,650件に大幅拡充する。\nさらに太陽光発電を導入した新築住宅に対して、不動産取得税を最大で全額減免する税制措置なども実施する方針だ。\n",
    "規制強化、支援拡充によって、2030年までに再エネ電力比率を17.3%（2019年度）から50%に、太陽光発電の導入量を61万kW（2019年度）から130万kWに拡大させる目標を掲げる。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "経済産業省は１４日、クリーンエネルギー戦略策定に向けた有識者会合（座長、白石隆・熊本県立大学理事長）を開催。\n脱炭素化に向けて積極的に取り組んでいる企業・団体から意見を聴取した。\nバイオものづくり（合成生物学）分野では、神戸大発ベンチャー、バッカス・バイオイノベーションの近藤昭彦取締役（神戸大学副学長・教授）が出席し、二酸化炭素（ＣＯ２）から有用物質を直接生産する水素細菌の可能性を紹介。\n「バイオものづくり技術は、ＧＨＧ（温室効果ガス）排出削減の大きな切り札になる」と述べた。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "世界的な不動産サービス会社は、「野心的な」持続可能性への取り組みを実現し、不動産がネットゼロの目標を達成できるよう支援するために、AlexandraIngramを任命しました。\n",
    "新たに創設された役割において、イングラムはビジネス全体にESGを組み込み、クライアントのネットゼロ戦略において環境的価値と社会的価値の両方を推進することに焦点を当てます。\n",
    "JLLはその役割の重要性を説明し、最近の構築環境の脱炭素化業界における持続可能性の重要性が認識されているにもかかわらず、43％の占有者がまだネットゼロ計画を定義する初期段階にあることを示すレポート。\n",
    "同社によれば、この任命は、組織がネットゼロへの取り組みを加速するのを支援するというコミットメントを浮き彫りにしているという。\n",
    "イングラムは2013年にJLLのアジアパシフィックキャピタルマーケットチームに加わりました。\n2017年に国際キャピタルマーケットオフィスチームに異動して以来、彼女はヨーロッパのオフィスとライフサイエンス市場を中心に活動してきました。\n",
    "JLLのEMEAキャピタルマーケッツビジネスのCEOであるマシューリチャーズは次のように述べています。\n",
    "「アリは、JLLがESGをすべてのクライアントのアドバイスに統合して、私たちの関係を深め、業界で最も知識が豊富で創造的でつながりのある資本アドバイザーになるのを支援します。\n」",
    "イングラムは次のように付け加えました。\n「私たちは今、責任ある不動産の時代にあり、ESGの台頭は企業の不動産と資本市場に変革の影響を与えるでしょう。\n",
    "「2022年は実際の行動の年であり、投資家が設定された野心的な目標を達成するのを支援する任務を負ったことを光栄に思います。\n 資本市場に加えて、JLLは、持続可能性をリースや評価などのすべてのコアビジネスラインに統合することに取り組んでおり、ビジネスライン間のこのコラボレーションは不可欠です。\n",
    "「私の野心は、JLLがヨーロッパ全体でナンバーワンのESG資本市場アドバイザーになることです。\nこの旅に出ることに興奮しています。\n」",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "輸入木材とのコスト競争力がなくなり、長年産業としては注視されることが少ない感のあった日本の林業がここにきて注目を浴び始めた。\n",
    "2050年までに温暖化ガス排出量を実質ゼロにするカーボンニュートラルの達成に向けた様々な取り組みが進む中で、森林は二酸化炭素（CO2）の吸収で大きな役割を果たす。\nただ、人工林は高齢化すると吸収量が減少してしまう。\nCO2の吸収量を高めていくためには人工林をしっかり間伐し、使用し、植えるのサイクルを活性化することが重要になり、木材の活用が見直されようとしている。\n",
    "さらにコロナ下では「ウッドショック」と呼ばれる世界的な建築用木材の高騰が発生し、安価な輸入木材が入手困難になり、国産の丸太価格も上がった。\nとはいえ、国内の林業は労働力の高齢化と人手不足など構造的な問題を多く抱える。\nそこでテクノロジーを活用しに林業分野のイノベーションに挑戦する動きが次々と生まれている。\n",
    "まずはドローン活用だ。\nこれまで険しい山道での苗木の運搬は重労働だった。\nそこでドローンによる苗木の運搬を行うことで繰り返し作業を自動運転で行うことができるので作業効率が劇的に改善される。\n",
    "所有者が分からなかったり、境界があいまいになっていたりする山が少なくないことも日本の林業の課題だが、ドローンが林地の上空や森の中から空撮分析することで境界の画定を可能にする。\n樹種の判別や材積（木材の容量）の算出、枯損木（こそんぼく）の調査などを行うことで資源量の正確な把握が可能になることも森林活用の第一歩と言える。\n",
    "トレーサビリティーも注目されている。\n森林で利用可能な高温乾燥に耐えられる耐久性の高い「NFCタグ」を木材に設置し、樹種、胸高直径、樹高、曲がり具合などの情報をスマホから入力し、クラウドで管理することが可能になった。\n",
    "木材用のNFCタグを開発したAndecoの早川慶朗代表は「サーキュラーエコノミー（循環経済）の時代は建物に使われている木材がどこで生まれてどのように育ってきたかを知ることは大事だ。\nさらに建物が解体されたあとの次の利用、その次の利用先とずっとその歴史をたどれるようになることも当然になる」と語る。\n",
    "他にも木材の可能性はまだまだ広がりを見せる。\n木粉を活用してストローの形に形成する技術なども登場しており、マイクロプラスチック問題などを解決するための取り組みとして期待されている。\n",
    "日本は木材とともに生活してきた木の文化を持つ国でもある。\n火災リスク低減やコスト削減、生産効率などを追い求めてきた結果、国産木材の利用は減ってきた。\nしかしステージが変わった今、世界最先端の木材活用先進国として、木材がふんだんに使われたスマートシティや木材でできたパーソナルモビリティーが走っているようなそんな未来を目指すことも本気で考えてよいのではないだろうか。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "製造段階での二酸化炭素の排出や水質汚染、衣服の廃棄問題など繊維・ファッションは環境負荷が大きいと言われる。\nこのままでは未来の地球にとって、「存在価値が低い産業」とされかねない。\n繊維・ファッションが持続可能な産業になるために黒衣として支える商社ができること、果たすべき役割を経営トップに聞いた。\n",
    "大きなテーマは循環型経済の実現だ。\n「回収・リサイクルのサークルをみんなで作る必要がある」と帝人フロンティアの平田恭成社長は話す。\n「自社だけでは限界がある。\n規模がないとコストが下がっていかない。\n〝繊維to繊維〟を実現するポリエステルの効率的なケミカルリサイクル技術を確立する」。\n伊藤忠商事などと一緒にジャパンサステナブルファッションアライアンス（JSFA）を立ち上げ、50年に向けてファッションロスゼロやカーボンニュートラルの達成を目指す。\n国際的なイノベーションプラットフォーム「ファッション・フォー・グッド」にも東アジア企業として初参画する。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "北九州市内で自動車部品を生産する企業の脱炭素化を進めようと、市が2月から、専門家による訪問支援に乗り出した。\n市によると、自動車産業が集積する九州では初の取り組み。\n脱炭素化を供給網全体で進める業界の動きへの対応を促し、地元企業の競争力強化につなげたい考えだ。\n【青木絵美】",
    "福岡、大分など北部九州には、トヨタ、日産など四つの大手自動車メーカーの工場と共に、関連部品を生産する企業が集積。\n北九州市内だけで60社超に上るという。\n",
    "訪問支援では、市が委託した省エネ診断の専門家が、各企業の温室効果ガス排出量を算定。\n削減の可能性を探り、省エネ機器や導入時の助成制度を紹介する。\nまた、太陽光発電パネルの設置場所を提供し、使った分の電気代を払う形で再生可能エネルギー100％の電力に切り替える、初期コスト不要の「再エネ100％北九州モデル」導入も提案する。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "JFEスチールと東北大学は、カーボンニュートラル時代を見据えた研究活動の推進を目指し、共創研究所を1日付で設けた。\n産学連携体制のもと、企業技術者と大学研究者の部門横断的な連携を通じて、低炭素製鉄プロセスに関する共同研究をさらに加速させるとともに、新材料開発をはじめ新規開発テーマの発掘を推進する。\n",
    "「JFEスチール×東北大学グリーンスチール共創研究所」と名付け、①共同研究テーマの推進＝低炭素製鉄プロセスに関する課題を多角的なア...",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "地球環境にまつわるごみ問題。\n日本全国にあるごみ処理施設はごみを燃焼させる焼却処理が主流ですが、世界的に高まるサステナビリティへの関心から、可燃ごみをエネルギーとして再利用するという、新しい潮流が生まれています。\nバイオマスによる再生可能エネルギー発電に取り組むのは、オリックス資源循環。\n埼玉県大里郡寄居町にあるバイオガスプラント、そこから見えてきたごみ処理の未来とは？",
    "ごみが持つ資源の価値を引き出す「乾式メタン発酵」とは？",
    "オリックス資源循環は、オリックスグループの廃棄物処理事業者で、埼玉県大里郡寄居町に整備された工業団地「彩の国資源循環工場」で、2006年から民間の処理施設（焼却・溶融）としては日本最大規模となる大規模リサイクル施設を運営しています。\nこの施設では工場から出る産業廃棄物、家庭から出る一般廃棄物を処理し、アスファルト舗装の材料（スラグ）や融雪剤（工業塩）などに再資源化しています。\n",
    "その工業団地において、2021年6月には、バイオマスによる再生可能エネルギー発電施設「寄居バイオガスプラント」を竣工しました。\n寄居バイオガスプラントは、一般廃棄物を活用した国内最大規模となる乾式のメタン発酵バイオガス発電施設です。\nこれは、食品廃棄物や紙ごみなどの一般廃棄物を菌の働きにより発酵処理し、生成されるバイオガスを発電燃料として活用する、CO2の排出削減に寄与する次世代型の発電施設となっています。\nメタン発酵には「湿式」と「乾式」による二つの技術があります。\n湿式メタン発酵は、排水処理の汚泥、家畜ふん尿などの液体～半液体状のバイオマスの処理が可能な技術。\n乾式メタン発酵は、「湿式」では処理が難しいとされる、水分含有率の低い有機物の発酵処理が可能なため、リサイクルの対象となる幅が広がるのです。\n食品廃棄物にプラスチック類などの発酵しない廃棄物が混じっていても発酵処理できるため、分別にかかる手間やコストを省くことができます。\n",
    "メタン発酵の「湿式」と「乾式」にはどんな違いがあるのでしょうか。\n湿式メタン発酵技術は、半液体状の家畜ふん尿をメタン発酵槽内でメタンガスを発生させ、焼却あるいはタービンを回すことによってエネルギーを得る方法。\n発生したメタンガスは燃焼させることによって電力利用や熱利用が可能なので、CO2の排出削減に寄与します。\n",
    "寄居バイオガスプラントで採用する乾式メタン発酵は、水分含有率の低い有機物の発酵処理が可能でリサイクル対象の幅が広いという特長のほか、湿式メタン発酵においてはメタン発酵に伴い発生する消化液の発生がほとんどないことが挙げられます。\nこのことは、処理水が放流できないためにメタン発酵によるメタンガス生成が困難であった地域においても、周辺水域の水質を保全しつつバイオマスを効率的に活用することを可能とします。\n",
    "「日本国内の家庭ごみの活用を目的としたメタン発酵施設は約30カ所です。\n稼働している乾式は民間ではたった2例だけなんですよ。\nもっと言えば、関東圏における乾式メタン発酵バイオガス発電施設の竣工は、寄居バイオガスプラントが初めてとなります。\nこのプラントの年間発電計画は約9,800,000kWh。\n規模で例えると、一般家庭約3,140世帯分の年間消費電力に相当する量になります。\nメタン発酵によるバイオガス事業はごみ処理を工夫することによって、ごみそのものが持っている資源の価値を引き出す役割があると個人的には捉えています」",
    "資源循環型社会の形成にいち早く取り組んできた",
    "1964年、オリックスはリース事業からスタートしました。\nリースが終了した後に必要となるのは廃棄という処理工程です。\n自社の所有物件を適正に処理するにあたり、廃棄物は協力会社に処理してもらっていたものの、自社で賄うことも必要だと考えるように。\n2006年当時のことを、オリックス資源循環 代表取締役社長の花井 薫一は振り返ります。\n",
    "「当時、世の中ではダイオキシン問題がクローズアップされていました。\nまた近年では地球温暖化問題の話題も大きくなり始め、われわれとしても、何か世の中のためになる新しい処理方式ができないかと埼玉県と相談していくなかで、県の空き用地を活用して乾式メタン発酵方式による、バイオマス発電事業をカタチにすることができたという経緯があります」",
    "2011年の東日本大震災が起きる以前、ごみは原則として焼却、という考え方でした。\n時代も変わり、再生可能エネルギーという考え方が付加されることによって、焼却以外の方式も必要とされるようになったわけですが、寄居バイオガスプラントの実現に行き着くまでにはさまざまなハードルがありました。\n",
    "「乾式メタン発酵による処理という方式の国内事例は、民間ではどこにもありませんでした。\nただ、われわれとしては、他社がやっていないこと、かつ世の中に役立つことをカタチにしよう、ということをコンセプトに進めていました。\n法規制や廃水処理の問題のほか、近隣住民の皆さんのご理解を得ることにとても苦労はしましたが、幸いにもこの十数年の間に、この場所での実績と地域との円滑なコミュニケーションを培ってきたこともあって、なんとか進めることができました」（花井）",
    "バイオマスによる再生可能エネルギー発電は、地球温暖化の原因となる、温室効果ガスの排出を抑制する効果があります。\n持続可能な社会を実現しようとする世の中の流れから、いわゆる脱炭素、カーボンニュートラルに取り組む企業は増えていますが、オリックス資源循環はなぜ取り組もうとするのでしょうか？",
    "「バイオマス発電は脱炭素社会だけでなく、ゴミを資源として活用する資源循環社会にも貢献する取り組みです。\n私自身に置き換えると、ごみ処理は人間が生活する上で必要不可欠なものですから、そこに自分が役に立てるという意味でもとてもうれしいことです。\nオリックスはさまざまな事業を展開する会社ですが、それぞれの事業を通して、社会に貢献しようという想いを持って取り組んでいる人たちがいます。\nその集合体がオリックスなんだろうなと思います」（亀岡）",
    "ごみ処理施設に新たな選択肢を",
    "寄居バイオガスプラントは2022年4月に運転開始を迎える予定です。\n本稼働を迎えるのはこれからですが、現時点でどんなビジョンを見据えているのでしょうか。\n",
    "「廃棄物としてどんな道筋をたどっていくのか、ものをつくる生産者側がこういったことを考えていただけると、ごみの分別も進んでいくと思います。\n将来的にどれだけリサイクル、リユースが進んだとしても、やはり焼却せざるを得ないシーンは無くならないと思うんです。\n廃棄物をバイオガスとしてエネルギー化していくということは、使えるものはとことん使うといった考え方でもあります。\nサステナビリティとも深く結びつきますので、できるところまで追求していきたいですね」（花井）",
    "「焼却方式やメタン発酵方式など、これからはごみの性質に応じて適した処理施設の立地と使い分けが必要となってきます。\nわれわれが採用している乾式メタン発酵バイオガス発電施設を、ごみ処理の選択肢のひとつにしていきたいですね」（亀岡）",
    "地方自治体の廃棄物について、基本的に可燃ごみは各ごみ処理施設で焼却処理されています。\nその一方、ごみ処理施設の老朽化が全国的に進んでおり、立地面や財政面などから建て替え困難な事案が増え続けている状況にあります。\n",
    "オリックス資源循環のようにごみ発電を実施する施設は全国的に増えているものの、日本国内における乾式メタン発酵の事例はあまりなく、これまでは湿式方式しかほぼ選択肢がありませんでした。\n湿式では焼却発電に不向きな厨芥類（台所から出る食物を調理した後のくず）だけを分別・回収することが困難などの理由により導入が進みませんでしたが、乾式であればこれらの現状課題を解決でき、またオリックス資源循環としては既存の大規模リサイクル施設をバックアップとして機能させられます。\n",
    "「今後は厨芥類を含めて行き場に迷うかもしれない可燃ごみの受け入れの増加を目指しています。\n私は乾式メタン発酵を通じて、業界としてより良いごみ処理事業をつくっていけるという強い想いを持っています。\n老朽化が進んだごみ処理施設を乾式メタン発酵に置き換えることで、ごみ処理のやり方全体が良くなっていく。\nそこに貢献できることは、大きなやりがいです」（亀岡）",
    "リース事業者として、ファイナンスだけではなく物件を適切に処理するという責務をはたすために、自ら物件を処理するという意思からオリックス資源循環が設立されました。\n不用物の処理から、ごみ処理事業への進出に深く関わっていた、ごみを資源として活用しようとする「もったいない」という気持ち。\nそこから生まれた乾式メタン発酵バイオガス発電事業から、ごみ処理の未来が大きく切り拓かれていこうとしています。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "この度、欧州系グローバル戦略コンサルティングファームのローランド・ベルガーと、無形資産/ESG等のデータ解析・可視化企業のアスタミューゼは、日本の脱炭素に貢献するスマートモビリティ領域に関する分析レポートの第2回を発表いたします。\n",
    "第1回では、モビリティ業界において今後重要性が増すと予想される４つの分野にフォーカスし、技術資産スコアを基に 脱炭素に貢献するスマートモビリティ領域企業ランキングを発表しました。\n",
    "第2回は、業界横断でのトレンド分析を実施の上、個別領域のトレンドや主要プレイヤーの動向について分析いたします。\n",
    "1. 業界横断でのトレンド変化",
    "本章では、まず全業界横断での価値のトレンドを参照し、そのマクロトレンドとの関連を紐解く。\n下図に、モビリティ業界の4つの価値大分類（低環境負荷、軽量化、デジタル化、サービス化）別の特許出願件数の推移を示す。\n",
    "対象企業における価値大分類別特許発行傾向",
    "この対応関係の中、Electric, Automated/Connected, Sharedそれぞれの領域には時系列でのトレンドが存在する。\nElectricでは法規制が主なドライバーとなっている。\nCO2削減規制への対応が、OEM/サプライヤー各社の生き残りに必須であることから、各社とも早期から主体的に技術開発に取組みを行っている。\n",
    "• Automated/Connectedは、核となる技術の進展が主なドライバーであり、ハードルとなっていたコア技術（AI・センサ）の開発が'10年前後に一気に進み、自動車業界の変革に大きく寄与している。\n",
    "• Sharedは、これまではハード（車両）を提供するOEMと、シェアードサービスを提供するサービス事業者で一定程度棲み分けがなされており、メーカー側は積極的には取り組んでいなかった領域である。\nしかし近年では、Tech系企業新参プレイヤーの事業参入も進み、OEMもモノからコトへの事業モデル転換を図る中、漸く技術開発が進みつつある領域となっている。\n",
    "加えて、以上の価値分類をさらに細分化した9分類を見てみると、「自動化」・「電気ハイブリッド駆動（以下「電動化」）」の2軸が、出願数の観点で大きく抜きんでている。\nこれら2軸は、いずれも未来のモビリティの標準装備として必要となりうる基盤技術であり、OEM・サプライヤー各社ともに、生き残りをかけて研究開発投資を進めている状況が見て取れる。\n",
    "対象企業における価値小分類別特許件数[件]",
    "２. 個別業界のトレンド変化",
    "本章では、個別業界のトレンドを、1）価値軸別業界動向の把握、2）主要プレイヤーカテゴリ別動向の深掘り、の2ステップで分析していく。\n",
    "1）価値軸別業界動向の把握",
    "まず、前章で触れた主要な価値軸（自動化、電動化）について、各種OEMやサプライヤー別の特許件数・申請内容の変遷をみると、各業界が辿る、技術革新のステップが存在することがわかる。\n自動化・電動化で技術内容は異なるものの、大きくは",
    "ステップ1：各種サプライヤー・ソフトウェア業者とOEMによる要素技術の開発",
    "ステップ2：OEMと電子・電装メーカーを主体とした統合・制御システム開発",
    "の順に進む。\nこの中で、建機・農機は、分野により自動車を追従する形でのその技術開発が進んでいく傾向が見て取れる。\n農機・建機の技術開発トレンドの詳細については、次章以降で分析していく。\n",
    "自動化・電動化における各業界の技術発展のステップ",
    "2） 主要プレイヤーカテゴリ別動向の深掘り",
    "自動車OEM",
    "まず、上記トレンドの中でも、特に大きな役割を担う自動車OEMについて、リソース配分・注力分野の推移をみていく。\n自動車OEMは、～'10年の低燃費から、'10年代前半は電動化、後半は自動化・コネクテッド等のデジタル分野にリソース配分をシフト。\n直近の特許出願内容からは、電動化においては、サプライヤーと開発分野を棲み分けている一方、デジタル化（自動化・Connected）の分野では、コア技術となるソフトウェア関連の分野で、ソフトウェア系企業に後れをとらないよう、特許取得を急ぐ傾向が垣間見える。\n",
    "自動車OEM業界におけるカテゴリ別特許出願数割合 [％]",
    "価値の中心がハードからソフトに移行していく業界の未来を見通し、常に高付加価値分野に重点を置き続けるという、自動車OEMの戦略が伺える。\n実際、トヨタも、2020年に「ソフトウェアファースト」を掲げ、SW企業への転換に取り組んでいる。\n",
    "建機農機OEM",
    "建機・農機の特徴として、自動車比での電動化の取組みの少なさ、農機でのデジタル化の遅れを取り戻す直近の急成長などが挙げられる。\n実際に特許内容をみても、2章（1）で記載の通り、電動化は建機・農機ともに技術発展のステップ1（要素技術開発）、自動化は建機ではステップ2（システム統合）だが農機では未だステップ1に留まっている。\n",
    "各種OEMにおける価値分類別特許出願件数トレンド",
    "こういったトレンドの背景として、自動車と建機・農機の業界特性やマクロトレンドの違いがある。\n電動化については、CO2排出に占める建機・農機のシェアが必ずしも大きくないことから、自動車の電動を推し進めた法規制などの外部圧力が建機・農機では強くなかった点、自動車に比べて必要出力が大きく技術ハードルが高い点が挙げられる。\n自動化・コネクテッドは、危険作業や盗難等の業界課題に対応すべく建機では早くから進展していた一方、農機では過去1~2年で急速に進展している。\nこれは大手メーカーが’10年代前半から進めていた必要データ蓄積の取組みが一定完了し、自動化技術開発の本格化に舵切りをした点に加え、農林水産省のスマート農業支援などの政策も当該分野の急成長を後押ししているものと考えられる。\n",
    "他方、建機・農機においても、今後の環境規制強化への対応や騒音等の業界課題の解決のため、自動車でみられたような電動化・自動化が順次進んでいくと想定される。\nこういった未来を見据えた研究開発・投資が、将来的な競争優位性を築くカギとなるであろう。\n",
    "次回、本シリーズの最終回となる第3回レポートでは、第1回で紹介した企業ランキングの上位企業について、各社の全社方針・研究開発戦略とも照らしながら、各企業の特許数・分野の変遷や、パテントインパクト／アセットスコアからみる有力技術を読み解いていく。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー",
    "伊藤忠商事は16日、持続可能な航空燃料（SAF）を輸入し国内で商用展開すると発表した。\nSAF大手のネステ（フィンランド）と独占販売契約を結んだ。\n2022年春にも羽田空港と成田国際空港で国内外の航空会社に供給を始める。\n22年は最大1万トン規模の輸入から始め、今後拡大する。\n航空業界ですすむ脱炭素化に対応するため、安定供給できる体制を整える。\n",
    "ネステのSAFは廃食用油や動物油脂などを原料とし、化石燃料由来と比べて二酸化炭素（CO2）の排出を減らせる。\n従来のジェット燃料に混ぜて使うことができ、主に欧米で販売が広がっている。\n20年には全日本空輸（ANA）がネステからSAFを調達した。\n",
    "国土交通省は30年までに国内航空会社の燃料使用量のうち10%をSAFに置き換える目標を掲げている。\n伊藤忠は独占販売権の獲得で商用規模のSAFを確保し、航空会社に売り込む。\nネステはシンガポールの製造拠点の拡張を計画中で、23年から増産に入る。\n生産量や需要拡大に応じて、日本向けの輸入量も増やす方針だ。\n",
    "ｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰｰーー"
]